Revit 2027 API
BuiltInFailures.RebarSystemFailures.ThinHostFloor Property
 Rebar Cover Top and Bottom are too large for host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ThinHostFloor { get; }
Public Shared ReadOnly Property ThinHostFloor As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ThinHostFloor {
	FailureDefinitionId^ get ();
}
static member ThinHostFloor : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarSystemFailures Class
Autodesk.Revit.DB Namespace